tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "neovim/neovim"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Record and share terminal sessions
brew "asciinema"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Terminal-based client for Spotify
brew "spotify-tui"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GPU-accelerated terminal emulator
cask "alacritty"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Web security testing toolkit
cask "burp-suite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Monospaced programming font inspired by the Minecraft typeface
cask "font-monocraft"
# GIT client
cask "fork"
# Free and open-source image editor
cask "gimp"
# Vector graphics editor
cask "inkscape"
# Keyboard customizer
cask "karabiner-elements"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Keyboard configurator
cask "via"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
