7zip
act
alsa-utils
anki
atuin
awww
aylurs-gtk-shell-git
base
base-devel
basemark
bat
bibata-cursor-theme-bin
bind
blender
bluetui
bluez-deprecated-tools
bluez-utils
brave-bin
brightnessctl
browserpass-chromium
btop
bun
chafa
chromium
chrono-date
claude-code
cliamp
cliphist
dart-sass
dbeaver
ddcci-driver-linux-dkms
ddcutil
discord
docker
docker-compose
dosfstools
efibootmgr
element-desktop
elephant
elephant-calc
elephant-clipboard
elephant-desktopapplications
elephant-files
elephant-providerlist
elephant-runner
elephant-symbols
elephant-websearch
eza
fastfetch
fd
feh
figma-linux
fontforge
foot
foremost
fprintd
freecad
furmark
fwupd
fzf
gamescope
ghidra
ghostty
gimp
git
git-delta
github-cli
glib2-devel
gnome-calculator
gnome-disk-utility
gnome-themes-extra
go
gputest
grim
grimblast-git
grub
gst-plugin-pipewire
gtk-engine-murrine
gtksourceview3
gvfs
hashcat
helium-browser-bin
htop
hypridle
hyprland
hyprlock
hyprpicker
hyprshutdown
hyprwayland-scanner
imagemagick
impala
inetutils
inkscape
intel-media-driver
intel-ucode
iwd
jdk-openjdk
john
kdeconnect
kitty
lazydocker
lazygit
libgtop
libpulse
libreoffice-still
linux
linux-firmware
linux-headers
localsend
luarocks
man-db
mate-polkit
matugen-bin
mise
mkcert
mpv
nano
nautilus
neovim
nmap
noto-fonts
noto-fonts-emoji
npm
nvidia-open
nvidia-prime
nvidia-settings
nvidia-utils
nvtop
nwg-look
obs-studio
obsidian
openbsd-netcat
opencl-nvidia
opencode
openrgb
orca-slicer-git
os-prober
otf-ipaexfont
otf-ipafont
otf-ipamjfont
pacman-contrib
papirus-icon-theme
paru
paru-debug
pass
php
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
postgresql
power-profiles-daemon
prismlauncher
python-gpustat
python-pip
qbittorrent
qmk
qt5-svg
qt5-wayland
qt6-multimedia-ffmpeg
rclone
ripgrep
rofi
rofi-tools-bin
ruby
ruby-certificate_authority
ruff
rustup
sassc
sddm
sing-box
sioyek-git
slurp
smartmontools
sof-firmware
solaar
spotify
spotify-player
starship
steam
stow
sudo
swappy
swaybg
swaync
telegram-desktop
tesseract-data-afr
texlive-fontsextra
texlive-latexextra
thunderbird
tldr
tmux
trash-cli
ttf-jetbrains-mono-nerd
typst
udiskie
ufw
usbutils
uwsm
v2rayn-bin
via-bin
vial-appimage
vim
vivid
vpl-gpu-rt
vulkan-intel
vulkan-tools
walker
waybar
wev
weylus-bin
wf-recorder-git
wget
wifite
wiremix
wireplumber
wl-clipboard
wpa_supplicant
wqy-microhei
wqy-zenhei
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-desktop-portal-termfilechooser-hunkyburrito-git
xdg-terminal-exec
xray
yazi
yt-dlp
zoxide
zram-generator
zsh
