7zip
alsa-utils
anki
atuin
awww
aylurs-gtk-shell-git
base
base-devel
bat
bind
blender
blueman
bluetui
bluez
bluez-deprecated-tools
bluez-utils
brave-bin
brightnessctl
btop
chafa
chromium
chrono-date
cliphist
dart-sass
dbeaver
ddcci-driver-linux-dkms
ddcutil
discord
docker
dunst
efibootmgr
element-desktop
eza
fastfetch
fd
feh
figma-linux
fontforge
fprintd
freecad
fzf
ghostty
gimp
git
git-delta
github-cli
glib2-devel
gnome-calculator
gnome-disk-utility
gnome-themes-extra
go
grim
grimblast-git
grub
gst-plugin-pipewire
gtk-engine-murrine
gtksourceview3
gvfs
htop
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
hyprwayland-scanner
inetutils
inkscape
intel-ucode
kdeconnect
lazygit
libgtop
libpulse
libva-nvidia-driver
linux
linux-firmware
linux-headers
localsend
luarocks
man-db
mate-polkit
matugen-bin
mise
mkcert
mpv
nano
nautilus
neovim
network-manager-applet
networkmanager
nmap
nodejs
noto-fonts-emoji
npm
nvidia-open
nvidia-prime
nvidia-settings
nvidia-utils
nwg-look
obs-studio
obsidian
openbsd-netcat
opencl-nvidia
opencode
openrgb
optimus-manager-git
orca-slicer
os-prober
otf-ipaexfont
otf-ipafont
otf-ipamjfont
pacman-contrib
paru
paru-debug
pass
pavucontrol
php
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
postgresql
power-profiles-daemon
prismlauncher
python-gpustat
python-pip
qmk
qt5-svg
ripgrep
rofi
rofi-tools-bin
ruby
ruby-certificate_authority
sassc
sing-box
slurp
smartmontools
sof-firmware
solaar
spotify
starship
steam
stow
sudo
swappy
telegram-desktop
texlive-fontsextra
texlive-latexextra
thunderbird
tldr
tmux
trash-cli
ttf-jetbrains-mono-nerd
typst
ufw
usbutils
v2rayn
via-bin
vial-appimage
vim
waybar
wev
weylus-bin
wf-recorder-git
wget
wireplumber
wl-clipboard
wpa_supplicant
wqy-microhei
wqy-zenhei
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-utils
yazi
yt-dlp
zen-browser-bin
zoxide
zram-generator
zsh
